{
  "email": "samuelsesing@gmail.com",
  "location": "Johannesburg, South Africa",
  "name": "Ntsese Samuel Sesing",
  "title": "Junior Software Developer",
  "phone": "+27 83 899 7674",
  "avatar": "https://example.com/avatar.jpg",
  "education": [
    {
      "title": "BSc Honours in Computing",
      "meta": "University of South Africa, Current"
    },
    {
      "title": "Advanced Diploma in Information Technology",
      "meta": "Vaal University of Technology, 2022"
    },
    {
      "title": "National Diploma in Information Technology",
      "meta": "Vaal University of Technology, 2021"
    }
  ],

  "work_experience": [
    {
      "title": "Junior Software Developer",
      "meta": "Nedbank, Johannesburg, South Africa",
      "date": "2023 - Present",
      "description": [
        "- Developing and maintaining web applications using Angular and C#.",
        "- Collaborating with cross-functional teams to define, design, and ship new features.",
        "- Participating in code reviews and ensuring adherence to best practices.",
        "- Troubleshooting and debugging applications to optimize performance.",
        "- Debugged and optimized systems using tools like Dynatrace and Transaction Log Viewer.",
        "- Provided end-user support and resolved queries within SLA on ServiceNow."
      ]
    },
    {
      "title": "Intern Software Engineer",
      "meta": "Nihilent Linted, Johannesburg, South Africa",
      "date": "2022 - 2023",
      "description": [
        "- Collaborated in an agile team to deliver software updates and bug fixes.",
        "- Gained experience in front-end development using Bootstrap and Angular.",
        "- Assisted in creating RESTful APIs for internal use.",
        "- Participated in daily stand-ups and sprint planning sessions.",
        "- Worked closely with senior developers to learn best practices."
      ]
    }
  ],
  "about": "Hi, I'm Samuel Sesing, a Junior Software Developer with a strong passion for technology and problem-solving. I specialize in front-end development and have experience building applications using Angular, C#, and Bootstrap. My focus is on creating intuitive, user-friendly interfaces and scalable software solutions.\n\nI am constantly learning and keeping up with the latest technologies, and I aim to bring innovative solutions to every project I work on. When I’m not coding, I enjoy exploring new tools and techniques to enhance my development skills.",
  "socials": [
    {
      "name": "LinkedIn",
      "link": "https://linkedin.com/in/johndoe",
      "icon": "linkedin"
    },
    {
      "name": "GitHub",
      "link": "https://github.com/johndoe",
      "icon": "github"
    },
    {
      "name": "Twitter",
      "link": "https://twitter.com/johndoe",
      "icon": "twitter"
    }
  ]
}
